Revit 2027 API
BuiltInFailures.DimensionFailures.ArcAlignmentRegenFailed Property
 Can't form arc alignment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArcAlignmentRegenFailed { get; }
Public Shared ReadOnly Property ArcAlignmentRegenFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArcAlignmentRegenFailed {
	FailureDefinitionId^ get ();
}
static member ArcAlignmentRegenFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace